{
  "_name_or_path": "/mnt/lustre/share_data/chenkeqin/VG/ckpt/llava/llava_v1/7B",
  "architectures": [
    "LlavaLlamaForCausalLM"
  ],
  "bos_token_id": 0,
  "eos_token_id": 1,
  "freeze_mm_mlp_adapter": false,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 2048,
  "max_sequence_length": 2048,
  "mm_hidden_size": 1024,
  "mm_use_im_start_end": true,
  "mm_vision_select_layer": -2,
  "mm_vision_tower": "/mnt/lustre/share_data/chenkeqin/VG/ckpt/openai/clip-vit-large-patch14",
  "model_type": "llava",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "pad_token_id": -1,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.28.0.dev0",
  "tune_mm_mlp_adapter": false,
  "use_cache": false,
  "use_mm_proj": true,
  "vocab_size": 32003
}
